remibert/pycameresp/patch/c/micropython/ports/esp32/machine_encoder.c
    if (args[ARG__src].u_obj != MP_OBJ_NULL) {
        self->bPinNumber = pin_or_int(args[ARG__src].u_obj);
        self->x124 = -1;
    } else {
        self->x124 = 0;
        mp_obj_t direction = args[ARG_direction].u_obj;
        if (direction != MP_OBJ_NULL) {
            if (mp_obj_is_type(direction, &machine_pin_type)) {
                self->bPinNumber = pin_or_int(direction);
            } else {
                self->bPinNumber = mp_obj_get_int(direction);
                if (!((self->bPinNumber == COUNTER_UP) || (self->bPinNumber == COUNTER_DOWN))) {
                    mp_raise_ValueError(MP_ERROR_TEXT(MP_ERROR_TEXT("direction")));
                }
            }
        }
    }

    if (args[ARG_edge].u_int != -1) {
        self->edge = args[ARG_edge].u_int;
    }

    // Prepare configuration for the PCNT unit
    pcnt_config_t r_enc_config;
    r_enc_config.unit = self->unit;
    r_enc_config.channel = PCNT_CHANNEL_0;

    r_enc_config.pulse_gpio_num = self->aPinNumber; // Pulses // Pulse input GPIO number, a negative value will be ignored
    r_enc_config.ctrl_gpio_num = self->bPinNumber; // Direction // Control signal input GPIO number, a negative value will be ignored

    // What to do on the positive / negative edge of pulse input?
    if (self->edge & RISING) {
        r_enc_config.pos_mode = PCNT_COUNT_INC; // Count up on the positive edge
    } else {
        r_enc_config.pos_mode = PCNT_COUNT_DIS; // Keep the counter value on the positive edge
    }
    if (self->edge & FALLING) {
        r_enc_config.neg_mode = PCNT_COUNT_INC; // Count up on the negative edge
    } else {
        r_enc_config.neg_mode = PCNT_COUNT_DIS; // Keep the counter value on the negative edge
    }

    // What to do when control input is low or high?
    if (self->bPinNumber == COUNTER_UP) {
        r_enc_config.lctrl_mode = PCNT_MODE_KEEP; // Keep the primary counter mode if low
        r_enc_config.hctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if high
    } else {
        r_enc_config.lctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if low
        r_enc_config.hctrl_mode = PCNT_MODE_KEEP; // Keep the primary counter mode if high
    }

    // Set the maximum and minimum limit values to watch
    r_enc_config.counter_h_lim = INT16_ROLL;
    r_enc_config.counter_l_lim = -INT16_ROLL;

    check_esp_err(pcnt_unit_config(&r_enc_config));

    // make sure channel 1 is not set
    r_enc_config.unit = self->unit;
    r_enc_config.channel = PCNT_CHANNEL_1; // channel 1

    if (args[ARG__src].u_obj != MP_OBJ_NULL) {
        r_enc_config.pulse_gpio_num = self->bPinNumber; // Pulse input GPIO number, a negative value will be ignored
        r_enc_config.ctrl_gpio_num = PCNT_PIN_NOT_USED; // Control signal input GPIO number, a negative value will be ignored

        // What to do when control input is low or high?
        r_enc_config.lctrl_mode = PCNT_MODE_REVERSE; // Reverse counting direction if low
        r_enc_config.hctrl_mode = PCNT_MODE_KEEP; // Keep the primary counter mode if high
    } else {
        r_enc_config.pos_mode = PCNT_COUNT_DIS; // disabling channel 1
        r_enc_config.neg_mode = PCNT_COUNT_DIS; // disabling channel 1

        r_enc_config.lctrl_mode = PCNT_MODE_DISABLE; // disabling channel 1
        r_enc_config.hctrl_mode = PCNT_MODE_DISABLE; // disabling channel 1
    }

    check_esp_err(pcnt_unit_config(&r_enc_config));

    if (args[ARG_filter_ns].u_int != -1) {
        self->filter = ns_to_filter(args[ARG_filter_ns].u_int);
    }
    // Filter out bounces and noise
    set_filter_value(self->unit, self->filter);
    pcnts[self->unit] = self;

    // Enable interrupts for PCNT unit
    check_esp_err(pcnt_counter_pause(self->unit));
    register_isr_handler();
    check_esp_err(pcnt_intr_enable(self->unit));
    // Enable events on maximum and minimum limit values
    check_esp_err(pcnt_event_enable(self->unit, PCNT_EVT_H_LIM));
    check_esp_err(pcnt_event_enable(self->unit, PCNT_EVT_L_LIM));
    check_esp_err(pcnt_counter_clear(self->unit));
    self->counter = 0;
    check_esp_err(pcnt_counter_resume(self->unit));
}

STATIC void pcnt_init_new(mp_pcnt_obj_t *self, size_t n_args, const mp_obj_t *args) {
    self->aPinNumber = PCNT_PIN_NOT_USED;
    self->bPinNumber = PCNT_PIN_NOT_USED;

    self->filter = 0;
    self->counter = 0;

    self->status = 0;
    self->match1 = 0;
    self->match2 = 0;
    self->counter_match1 = 0;
    self->counter_match2 = 0;
    self->handler_match1 = MP_OBJ_NULL;
    self->handler_match2 = MP_OBJ_NULL;
    self->handler_zero = MP_OBJ_NULL;

    self->unit = mp_obj_get_int(args[0]);
    if ((self->unit < 0) || (self->unit >= PCNT_UNIT_MAX)) {
        mp_raise_msg_varg(&mp_type_ValueError, MP_ERROR_TEXT("id must be from 0 to %d"), PCNT_UNIT_MAX - 1);
    }
    if (pcnts[self->unit] != MP_OBJ_NULL) {
        mp_raise_msg(&mp_type_Exception, MP_ERROR_TEXT("already used"));
    }

    if (n_args >= 2) {
        self->aPinNumber = pin_or_int(args[1]);
    }
}

STATIC mp_obj_t machine_Counter_make_new(const mp_obj_type_t *type, size_t n_args, size_t n_kw, const mp_obj_t *args) {
    mp_arg_check_num(n_args, n_kw, 1, 4, true);

    // create Counter object for the given unit
    mp_pcnt_obj_t *self = m_new_obj(mp_pcnt_obj_t);
    self->base.type = &machine_Counter_type;

    pcnt_init_new(self, n_args, args);

    // Process the remaining parameters
    mp_map_t kw_args;
    mp_map_init_fixed_table(&kw_args, n_kw, args + n_args);
    mp_machine_Counter_init_helper(self, n_args - 1, args + 1, &kw_args);
    return MP_OBJ_FROM_PTR(self);
}

STATIC mp_obj_t machine_Counter_init(size_t n_args, const mp_obj_t *args, mp_map_t *kw_args) {
    mp_machine_Counter_init_helper(args[0], n_args - 1, args + 1, kw_args);
    return mp_const_none;
}
MP_DEFINE_CONST_FUN_OBJ_KW(machine_Counter_init_obj, 1, machine_Counter_init);

STATIC void common_print_kw(const mp_print_t *print, mp_pcnt_obj_t *self) {
    if (self->handler_match1 != MP_OBJ_NULL) {
        mp_printf(print, ", match1=%ld", self->match1);
    }
    if (self->handler_match2 != MP_OBJ_NULL) {
        mp_printf(print, ", match2=%ld", self->match2);
    }
    mp_printf(print, ", filter_ns=%d)", filter_to_ns(self->filter));
}

STATIC void machine_Counter_print(const mp_print_t *print, mp_obj_t self_obj, mp_print_kind_t kind) {
    mp_pcnt_obj_t *self = MP_OBJ_TO_PTR(self_obj);

    mp_printf(print, "Counter(%u, src=Pin(%u)", self->unit, self->aPinNumber);
    if (self->x124 < 0) {
        mp_printf(print, ", _src=Pin(%u)", self->bPinNumber);
    } else {
        if (self->bPinNumber >= 0) {
            mp_printf(print, ", direction=Pin(%u)", self->bPinNumber);
        } else {
            mp_printf(print, ", direction=Counter.%s", self->bPinNumber == COUNTER_UP ? "UP" : "DOWN");
        }
    }
    mp_printf(print, ", edge=Counter.%s", self->edge == RISING ? "RISING" : self->edge == FALLING ? "FALLING" : "RISING | Counter.FALLING");
    common_print_kw(print, self);
}

// Register class methods
#define COMMON_METHODS \
    { MP_ROM_QSTR(MP_QSTR_deinit), MP_ROM_PTR(&machine_PCNT_deinit_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_value), MP_ROM_PTR(&machine_PCNT_count_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_get_value), MP_ROM_PTR(&machine_PCNT_get_count_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_filter_ns), MP_ROM_PTR(&machine_PCNT_filter_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_pause), MP_ROM_PTR(&machine_PCNT_pause_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_resume), MP_ROM_PTR(&machine_PCNT_resume_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_id), MP_ROM_PTR(&machine_PCNT_id_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_status), MP_ROM_PTR(&machine_PCNT_status_obj) }, \
    { MP_ROM_QSTR(MP_QSTR_irq), MP_ROM_PTR(&machine_PCNT_irq_obj) }

